In [34]:
cities=['delhi','bangalore','chenni']
print(cities)

['delhi', 'bangalore', 'chenni']

In [1]:
!pip install modin[ray]

Collecting modin[ray]
  Downloading https://files.pythonhosted.org/packages/5c/e5/44a4dfc838612d660cedbda722112f91c28da6be5a4604cf0b7356049249/modin-0.8.3-py3-none-win_amd64.whl (564kB)
Requirement already satisfied: packaging in c:\users\admin\anaconda3\lib\site-packages (from modin[ray]) (19.2)
Collecting pandas==1.1.5 (from modin[ray])
  Downloading https://files.pythonhosted.org/packages/47/17/5c4b04caa8fe1dca2aa940dcc00319aa77c84fbdb71f83869a0900cac660/pandas-1.1.5-cp37-cp37m-win_amd64.whl (8.7MB)
Collecting ray>=1.0.0; extra == "ray" (from modin[ray])
  Downloading https://files.pythonhosted.org/packages/35/9a/80396dd0050f7992ce239c7759cf658e237de2ae39765d537fcb3c04d68f/ray-1.1.0-cp37-cp37m-win_amd64.whl (15.4MB)
Collecting pyarrow==1.0; extra == "ray" (from modin[ray])
  Downloading https://files.pythonhosted.org/packages/7d/52/4ef42100c8a48c37bd5017ca23e114dea44ad71506bbd2b6569158ddcecf/pyarrow-1.0.0-cp37-cp37m-win_amd64.whl (10.5MB)
Requirement already satisfied: six in c:\users\admin\anaconda3\lib\site-packages (from packaging->modin[ray]) (1.12.0)
Requirement already satisfied: pyparsing>=2.0.2 in c:\users\admin\anaconda3\lib\site-packages (from packaging->modin[ray]) (2.4.2)
Requirement already satisfied: pytz>=2017.2 in c:\users\admin\anaconda3\lib\site-packages (from pandas==1.1.5->modin[ray]) (2019.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\admin\anaconda3\lib\site-packages (from pandas==1.1.5->modin[ray]) (2.8.0)
Requirement already satisfied: numpy>=1.15.4 in c:\users\admin\anaconda3\lib\site-packages (from pandas==1.1.5->modin[ray]) (1.16.5)
Collecting msgpack<2.0.0,>=1.0.0 (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/b4/95/babed3f02a7128c30f2cce29f63b0822da15b1ff423bbbf7d23595ad8174/msgpack-1.0.2-cp37-cp37m-win_amd64.whl (68kB)
Requirement already satisfied: pyyaml in c:\users\admin\anaconda3\lib\site-packages (from ray>=1.0.0; extra == "ray"->modin[ray]) (5.1.2)
Collecting redis>=3.5.0 (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/a7/7c/24fb0511df653cf1a5d938d8f5d19802a88cef255706fdda242ff97e91b7/redis-3.5.3-py2.py3-none-any.whl (72kB)
Requirement already satisfied: jsonschema in c:\users\admin\anaconda3\lib\site-packages (from ray>=1.0.0; extra == "ray"->modin[ray]) (3.0.2)
Requirement already satisfied: requests in c:\users\admin\anaconda3\lib\site-packages (from ray>=1.0.0; extra == "ray"->modin[ray]) (2.22.0)
Collecting py-spy>=0.2.0 (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/d9/53/82ec2c43f9cd924ea23aa883f3e63117d843bdee0b746b809c6e5c4b9c84/py_spy-0.3.4-py2.py3-none-win_amd64.whl (1.4MB)
Requirement already satisfied: filelock in c:\users\admin\anaconda3\lib\site-packages (from ray>=1.0.0; extra == "ray"->modin[ray]) (3.0.12)
Collecting colorful (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/b0/8e/e386e248266952d24d73ed734c2f5513f34d9557032618c8910e605dfaf6/colorful-0.5.4-py2.py3-none-any.whl (201kB)
Collecting gpustat (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/b4/69/d8c849715171aeabd61af7da080fdc60948b5a396d2422f1f4672e43d008/gpustat-0.6.0.tar.gz (78kB)
Collecting opencensus (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/e2/d6/b952f11b29c3a0cbec5620de3c4260cecd8c4329d83e91587edb48691e15/opencensus-0.7.12-py2.py3-none-any.whl (127kB)
Requirement already satisfied: colorama in c:\users\admin\anaconda3\lib\site-packages (from ray>=1.0.0; extra == "ray"->modin[ray]) (0.4.1)
Requirement already satisfied: prometheus-client>=0.7.1 in c:\users\admin\anaconda3\lib\site-packages (from ray>=1.0.0; extra == "ray"->modin[ray]) (0.7.1)
Collecting aiohttp (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/68/4a/221ace4d2283cc3d3b15e9621bb040d239dfea1b3da798ca33a88f8acfc8/aiohttp-3.7.3-cp37-cp37m-win_amd64.whl (629kB)
Collecting grpcio>=1.28.1 (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/91/e8/f55bf28a975f30f3cb4fd31db7c84eb3ae1551628230cafd7cf33b02b732/grpcio-1.34.1-cp37-cp37m-win_amd64.whl (2.9MB)
Requirement already satisfied: click>=7.0 in c:\users\admin\anaconda3\lib\site-packages (from ray>=1.0.0; extra == "ray"->modin[ray]) (7.0)
Collecting protobuf>=3.8.0 (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/1d/f4/089025cfa3ee62f89cae73f4d36daf46f339c6df61becfe4b24f3aeb3c0d/protobuf-3.14.0-cp37-cp37m-win_amd64.whl (798kB)
Collecting aiohttp-cors (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/13/e7/e436a0c0eb5127d8b491a9b83ecd2391c6ff7dcd5548dfaec2080a2340fd/aiohttp_cors-0.7.0-py3-none-any.whl
Collecting aioredis (from ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/b0/64/1b1612d0a104f21f80eb4c6e1b6075f2e6aba8e228f46f229cfd3fdac859/aioredis-1.3.1-py3-none-any.whl (65kB)
Requirement already satisfied: setuptools in c:\users\admin\anaconda3\lib\site-packages (from jsonschema->ray>=1.0.0; extra == "ray"->modin[ray]) (41.4.0)
Requirement already satisfied: pyrsistent>=0.14.0 in c:\users\admin\anaconda3\lib\site-packages (from jsonschema->ray>=1.0.0; extra == "ray"->modin[ray]) (0.15.4)
Requirement already satisfied: attrs>=17.4.0 in c:\users\admin\anaconda3\lib\site-packages (from jsonschema->ray>=1.0.0; extra == "ray"->modin[ray]) (19.2.0)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in c:\users\admin\anaconda3\lib\site-packages (from requests->ray>=1.0.0; extra == "ray"->modin[ray]) (3.0.4)
Requirement already satisfied: idna<2.9,>=2.5 in c:\users\admin\anaconda3\lib\site-packages (from requests->ray>=1.0.0; extra == "ray"->modin[ray]) (2.8)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\users\admin\anaconda3\lib\site-packages (from requests->ray>=1.0.0; extra == "ray"->modin[ray]) (1.24.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\admin\anaconda3\lib\site-packages (from requests->ray>=1.0.0; extra == "ray"->modin[ray]) (2019.9.11)
Collecting nvidia-ml-py3>=7.352.0 (from gpustat->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/6d/64/cce82bddb80c0b0f5c703bbdafa94bfb69a1c5ad7a79cff00b482468f0d3/nvidia-ml-py3-7.352.0.tar.gz
Requirement already satisfied: psutil in c:\users\admin\anaconda3\lib\site-packages (from gpustat->ray>=1.0.0; extra == "ray"->modin[ray]) (5.6.3)
Collecting blessings>=1.6 (from gpustat->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/03/74/489f85a78247609c6b4f13733cbf3ba0d864b11aa565617b645d6fdf2a4a/blessings-1.7-py3-none-any.whl
Collecting opencensus-context==0.1.2 (from opencensus->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/f1/33/990f1bd9e7ee770fc8d3c154fc24743a96f16a0e49e14e1b7540cc2fdd93/opencensus_context-0.1.2-py2.py3-none-any.whl
Collecting google-api-core<2.0.0,>=1.0.0 (from opencensus->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/59/52/0ac071e86ab1f0ab0e4d2d8dc81ad1722dbe73e315dcb4d9693103ca1927/google_api_core-1.25.0-py2.py3-none-any.whl (92kB)
Collecting multidict<7.0,>=4.5 (from aiohttp->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/5d/28/b0de1212a56e48f07282628a5dbac7852135553a5dfd371c6d6369e9511f/multidict-5.1.0-cp37-cp37m-win_amd64.whl (48kB)
Collecting typing-extensions>=3.6.5 (from aiohttp->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/60/7a/e881b5abb54db0e6e671ab088d079c57ce54e8a01a3ca443f561ccadb37e/typing_extensions-3.7.4.3-py3-none-any.whl
Collecting yarl<2.0,>=1.0 (from aiohttp->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/ea/53/3c466bee8503325c2cb182f5c7152a775b1a8c10e4d15b7c9cf9a5bf18ab/yarl-1.6.3-cp37-cp37m-win_amd64.whl (124kB)
Collecting async-timeout<4.0,>=3.0 (from aiohttp->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/e1/1e/5a4441be21b0726c4464f3f23c8b19628372f606755a9d2e46c187e65ec4/async_timeout-3.0.1-py3-none-any.whl
Collecting hiredis (from aioredis->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/88/1e/27a23f8eadf191cfc6a204346d77f922615d5fb7e265872e715e95a118d6/hiredis-1.1.0-cp37-cp37m-win_amd64.whl
Collecting googleapis-common-protos<2.0dev,>=1.6.0 (from google-api-core<2.0.0,>=1.0.0->opencensus->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/03/74/3956721ea1eb4bcf7502a311fdaa60b85bd751de4e57d1943afe9b334141/googleapis_common_protos-1.52.0-py2.py3-none-any.whl (100kB)
Collecting google-auth<2.0dev,>=1.21.1 (from google-api-core<2.0.0,>=1.0.0->opencensus->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/3e/fd/df1b3a59aca9537a187413651ad63b290d165559150a868a298fa837fe7b/google_auth-1.24.0-py2.py3-none-any.whl (114kB)
Collecting cachetools<5.0,>=2.0.0 (from google-auth<2.0dev,>=1.21.1->google-api-core<2.0.0,>=1.0.0->opencensus->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/92/da/d3c94fc7c72ad9298072681ec3e8cea86949acc5c4cce4290ba21f7050a8/cachetools-4.2.0-py3-none-any.whl
Collecting pyasn1-modules>=0.2.1 (from google-auth<2.0dev,>=1.21.1->google-api-core<2.0.0,>=1.0.0->opencensus->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/95/de/214830a981892a3e286c3794f41ae67a4495df1108c3da8a9f62159b9a9d/pyasn1_modules-0.2.8-py2.py3-none-any.whl (155kB)
Collecting rsa<5,>=3.1.4; python_version >= "3.6" (from google-auth<2.0dev,>=1.21.1->google-api-core<2.0.0,>=1.0.0->opencensus->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/bf/87/dc7a6ebf0afbc602548627fa48e9c1147fa187233bf71d4c51c76a2cfb27/rsa-4.7-py3-none-any.whl
Collecting pyasn1<0.5.0,>=0.4.6 (from pyasn1-modules>=0.2.1->google-auth<2.0dev,>=1.21.1->google-api-core<2.0.0,>=1.0.0->opencensus->ray>=1.0.0; extra == "ray"->modin[ray])
  Downloading https://files.pythonhosted.org/packages/62/1e/a94a8d635fa3ce4cfc7f506003548d0a2447ae76fd5ca53932970fe3053f/pyasn1-0.4.8-py2.py3-none-any.whl (77kB)
Building wheels for collected packages: gpustat, nvidia-ml-py3
  Building wheel for gpustat (setup.py): started
  Building wheel for gpustat (setup.py): finished with status 'done'
  Created wheel for gpustat: filename=gpustat-0.6.0-cp37-none-any.whl size=12627 sha256=8eb8e4e90834896944301158f66e1ed4338fe746507e1e1ae4dad6240443989b
  Stored in directory: C:\Users\Admin\AppData\Local\pip\Cache\wheels\48\b4\d5\fb5b7f1d040f2ff20687e3bad6867d63155dbde5a7c10f4293
  Building wheel for nvidia-ml-py3 (setup.py): started
  Building wheel for nvidia-ml-py3 (setup.py): finished with status 'done'
  Created wheel for nvidia-ml-py3: filename=nvidia_ml_py3-7.352.0-cp37-none-any.whl size=19197 sha256=363e59726caa447c33766c52961136183282a0021148f74aa4c9a9584924b89f
  Stored in directory: C:\Users\Admin\AppData\Local\pip\Cache\wheels\e4\1d\06\640c93f5270d67d0247f30be91f232700d19023f9e66d735c7
Successfully built gpustat nvidia-ml-py3
Installing collected packages: pandas, msgpack, redis, py-spy, colorful, nvidia-ml-py3, blessings, gpustat, opencensus-context, protobuf, googleapis-common-protos, cachetools, pyasn1, pyasn1-modules, rsa, google-auth, google-api-core, opencensus, multidict, typing-extensions, yarl, async-timeout, aiohttp, grpcio, aiohttp-cors, hiredis, aioredis, ray, pyarrow, modin
  Found existing installation: pandas 0.24.2
    Uninstalling pandas-0.24.2:
      Successfully uninstalled pandas-0.24.2
  Found existing installation: msgpack 0.6.1
    Uninstalling msgpack-0.6.1:
      Successfully uninstalled msgpack-0.6.1
Successfully installed aiohttp-3.7.3 aiohttp-cors-0.7.0 aioredis-1.3.1 async-timeout-3.0.1 blessings-1.7 cachetools-4.2.0 colorful-0.5.4 google-api-core-1.25.0 google-auth-1.24.0 googleapis-common-protos-1.52.0 gpustat-0.6.0 grpcio-1.34.1 hiredis-1.1.0 modin-0.8.3 msgpack-1.0.2 multidict-5.1.0 nvidia-ml-py3-7.352.0 opencensus-0.7.12 opencensus-context-0.1.2 pandas-1.1.5 protobuf-3.14.0 py-spy-0.3.4 pyarrow-1.0.0 pyasn1-0.4.8 pyasn1-modules-0.2.8 ray-1.1.0 redis-3.5.3 rsa-4.7 typing-extensions-3.7.4.3 yarl-1.6.3

ERROR: google-api-core 1.25.0 has requirement six>=1.13.0, but you'll have six 1.12.0 which is incompatible.

In [ ]:
###''code will use for singel word
###" " double code will use for singel sentences
###""" """ trile code for paragraph and mutilpe sentences

In [5]:
print('hello')
print("hello bangalore")
print('''hello bangalore "it's bangalore"''')

hello
hello bangalore
hello bangalore "it's bangalore"

In [23]:
d=cities.remove('bangalore')
d

In [24]:
cities

['delhi', 'chenni']

In [29]:
 del cities[0]

In [30]:
cities

['chenni']

In [31]:
dic={"a":"chaitanya","b":"reddy","a":"palle"}##key must be unique value.otherwise the value should be over write
dic

{'a': 'palle', 'b': 'reddy'}

In [38]:
"mumbai" in cities

False

In [39]:
"bangalore" in cities

True

In [40]:
"hydrabd" not in cities

True

In [36]:
len(cities)

3

In [56]:
for i in range(1,10):########inverse of numbers
    print("Inverse of {0} is {1}".format(i,round(1/i,3)))

Inverse of 1 is 1.0
Inverse of 2 is 0.5
Inverse of 3 is 0.333
Inverse of 4 is 0.25
Inverse of 5 is 0.2
Inverse of 6 is 0.167
Inverse of 7 is 0.143
Inverse of 8 is 0.125
Inverse of 9 is 0.111

In [69]:
dic1={'d':"delhi",'b':"banglore",'c':"chenni"}
dic1

{'d': 'delhi', 'b': 'banglore', 'c': 'chenni'}

In [90]:
res2=[]########converting dict to list

In [91]:
for keys,values in dic1.items():
    res2.append(keys)
    res2.append(values)
print(res2)

['d', 'delhi', 'b', 'banglore', 'c', 'chenni']

In [92]:
list("chaitanya")###list comprehetion ##evry charactor separated out be an element.LIst function###list("arument")

['c', 'h', 'a', 'i', 't', 'a', 'n', 'y', 'a']

In [1]:
import numpy as np

In [96]:
arr=np.array([[1,2,3],[3,4,5]])
arr

array([[1, 2, 3],
       [3, 4, 5]])

In [98]:
arr1=np.arange(1,7).reshape(2,3)
arr1

array([[1, 2, 3],
       [4, 5, 6]])

In [101]:
arr1=np.arange(1,26).reshape(5,5)
arr1

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [102]:
arr1[:,0]

array([ 1,  6, 11, 16, 21])

In [103]:
arr1[0,:]

array([1, 2, 3, 4, 5])

In [104]:
arr1[1:3,2:4]

array([[ 8,  9],
       [13, 14]])

In [105]:
arr1[2:,3:]

array([[14, 15],
       [19, 20],
       [24, 25]])

In [106]:
arr1[::-1]

array([[21, 22, 23, 24, 25],
       [16, 17, 18, 19, 20],
       [11, 12, 13, 14, 15],
       [ 6,  7,  8,  9, 10],
       [ 1,  2,  3,  4,  5]])

In [109]:
arr1[:,::-1]

array([[ 5,  4,  3,  2,  1],
       [10,  9,  8,  7,  6],
       [15, 14, 13, 12, 11],
       [20, 19, 18, 17, 16],
       [25, 24, 23, 22, 21]])

In [121]:
arr1[::,1]

array([ 2,  7, 12, 17, 22])

In [123]:
arr2=np.arange(1,10).reshape(3,3)
arr2

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [125]:
arr2.mean()

5.0

In [136]:
arr2.mean(0)

array([4., 5., 6.])

In [137]:
arr2.mean(1)

array([2., 5., 8.])

In [138]:
np.random.randint

In [2]:
from numpy.random import randint

In [3]:
from numpy.random import randn

In [158]:
randn(5)

array([-0.0473328 , -0.28949875,  1.11901061, -1.8733548 ,  0.80393854])

In [178]:
randint(45)

43

In [180]:
arr3=np.arange(1,11).reshape(1,10)
arr3

array([[ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10]])

In [198]:
arr4=np.random.randint(1,8,7)
arr4

array([5, 4, 5, 5, 2, 5, 5])

In [199]:
arr4.max()

5

In [192]:
arr2.min()

1

In [204]:
arr4=np.random.randint(1,8,7)##### identifly the maximum value amoung those two arrays arr4,arr5
arr4

array([6, 5, 3, 1, 4, 3, 5])

In [196]:
arr5=np.random.randint(1,8,7)
arr5

array([4, 5, 6, 4, 5, 1, 1])

In [203]:
a=np.maximum(arr4,arr5)#### syntax
a

array([5, 5, 6, 5, 5, 5, 5])

In [205]:
np.nan

nan

In [207]:
arr0=np.array([[1,np.nan,np.nan],[np.nan,4,5]])
arr0

array([[ 1., nan, nan],
       [nan,  4.,  5.]])

In [208]:
type(arr0)

numpy.ndarray

In [210]:
ar1=np.array([[True,True,True],[False,False,False],[True,True,False]])
ar1

array([[ True,  True,  True],
       [False, False, False],
       [ True,  True, False]])

In [215]:
a=np.array([True,True,True])
a

array([ True,  True,  True])

In [216]:
a.all

In [217]:
a.any

In [ ]:
###########Where function ############

In [219]:
a=np.array([1,2,3,4])
b=np.array([100,200,300,400])
c=np.array([True,False,True,False])

In [221]:
a
b
c

array([ True, False,  True, False])

In [224]:
d=np.where(c,a,b)
print(d)

[  1 200   3 400]

In [226]:
e=np.array([[1,2],[3,4]])
f=np.array([[100,200],[300,400]])
g=np.array([[True,True],[False,False]])

In [228]:
h=np.where(g,e,f)
h

array([[  1,   2],
       [300, 400]])

In [ ]:
#################PANDAS###################

In [4]:
import pandas as pd

In [5]:
from pandas import Series

In [232]:
Ser1=Series([1,2,3,4,5,6])
Ser1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [236]:
Ser2=Series(["chenni","mumbai","bangalore"])
Ser2

0       chenni
1       mumbai
2    bangalore
dtype: object

In [237]:
Ser3=Series([100,200,300,400,500],index=['A','B','C','D','E'])### Series using list in this method
Ser3

A    100
B    200
C    300
D    400
E    500
dtype: int64

In [241]:
Ser4=Series(np.arange(100,401,100),index=[30,40,50,50])###### Series using with arrays to genrate Series 
Ser4

30    100
40    200
50    300
50    400
dtype: int32

In [243]:
Ser5=Series({'A':'chaitanya','B':'Reddy','c':'palle'})
Ser5

A    chaitanya
B        Reddy
c        palle
dtype: object

In [244]:
Ser5.index

Index(['A', 'B', 'c'], dtype='object')

In [245]:
Ser5.values

array(['chaitanya', 'Reddy', 'palle'], dtype=object)

In [246]:
Ser5.items

<bound method Series.iteritems of A    chaitanya
B        Reddy
c        palle
dtype: object>

In [248]:
Ser6=Series(['alpha','beta','gamaa'],index=['A','A','B'])
Ser6

A    alpha
A     beta
B    gamaa
dtype: object

In [ ]:
#######selecting enteries in series #################

In [249]:
Ser3=Series([100,200,300,400,500],index=['A','B','C','D','E'])
Ser3

A    100
B    200
C    300
D    400
E    500
dtype: int64

In [252]:
Ser3['A']## this method is called grab by index name,or grab by index label

100

In [253]:
Ser3[0]#### this method is called grab by default indexing method###########

100

In [254]:
Ser3[1:4]##  scliing This is called as grab by index Range###

B    200
C    300
D    400
dtype: int64

In [255]:
Ser3[["A","C"]]## this is called as grab by multiple index label.

A    100
C    300
dtype: int64

In [257]:
Ser3[Ser3 > 300]## this is called as grab by logic.......

D    400
E    500
dtype: int64

In [258]:
Ser3 > 300

A    False
B    False
C    False
D     True
E     True
dtype: bool

In [263]:
fb1=Series(np.array([5,2,5,1]),index=['vig1','vig2','san','shas'])
fb2=Series(np.array([np.nan,np.nan,5,3]),index=['vig1','vig2','san','shas'])

In [265]:
fb1

vig1    5
vig2    2
san     5
shas    1
dtype: int32

In [266]:
fb2

vig1    NaN
vig2    NaN
san     5.0
shas    3.0
dtype: float64

In [267]:
fb2.isnull()

vig1     True
vig2     True
san     False
shas    False
dtype: bool

In [268]:
fb2.notnull()

vig1    False
vig2    False
san      True
shas     True
dtype: bool

In [269]:
fb1+10

vig1    15
vig2    12
san     15
shas    11
dtype: int32

In [270]:
fb1+fb2

vig1     NaN
vig2     NaN
san     10.0
shas     4.0
dtype: float64

In [277]:
fb11=Series(np.where(fb2.isnull(),fb1,fb2),index=fb1.index)#### replacing null value using where method.
fb11

vig1    5.0
vig2    2.0
san     5.0
shas    3.0
dtype: float64

In [ ]:
#############Data Frames#################

In [6]:
from pandas import DataFrame

In [283]:
df1=DataFrame(np.arange(1,26).reshape(5,5))
df1

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [290]:
df1=DataFrame(np.arange(1,26).reshape(5,5),index=list('ABCDE'),columns=['col1','col2','col3','col4','col5'])
df1### renameing the columns labels index and row index labels

   col1  col2  col3  col4  col5
A     1     2     3     4     5
B     6     7     8     9    10
C    11    12    13    14    15
D    16    17    18    19    20
E    21    22    23    24    25

In [292]:
df2=DataFrame({"Name":['chaitanya','vig1','vig2','giji1','adithya'],"Age":[25,25,30,24,26]})
df2

        Name  Age
0  chaitanya   25
1       vig1   25
2       vig2   30
3      giji1   24
4    adithya   26

In [295]:
df2=DataFrame({"Name":['chaitanya','vig1','vig2','giji1','adithya'],"Age":[25,25,30,24,26]},index=list('ABCDE'))
df2

        Name  Age
A  chaitanya   25
B       vig1   25
C       vig2   30
D      giji1   24
E    adithya   26

In [7]:
df3=DataFrame({"compay":["TCS","WIPRO","GOOGLE","YAHOO","CISCO"],"Ticker":["TCS","WIP","GOOG","YAH","CISC"],
               "price":[100,200,250,310,280]})
df3

   compay Ticker  price
0     TCS    TCS    100
1   WIPRO    WIP    200
2  GOOGLE   GOOG    250
3   YAHOO    YAH    310
4   CISCO   CISC    280

In [8]:
df3['compay']#### singel coloumn it will give series

0       TCS
1     WIPRO
2    GOOGLE
3     YAHOO
4     CISCO
Name: compay, dtype: object

In [9]:
df3[['compay','price']]## grabing mutilple columns we will get data frame

   compay  price
0     TCS    100
1   WIPRO    200
2  GOOGLE    250
3   YAHOO    310
4   CISCO    280

In [14]:
df3[df3['price']>200]#### grab by logic fetching data

   compay Ticker  price
2  GOOGLE   GOOG    250
3   YAHOO    YAH    310
4   CISCO   CISC    280

In [17]:
df3['price']>200

0    False
1    False
2     True
3     True
4     True
Name: price, dtype: bool

In [18]:
df3[0:3]#grab by using index range

   compay Ticker  price
0     TCS    TCS    100
1   WIPRO    WIP    200
2  GOOGLE   GOOG    250

In [21]:
df3['Year']=[2020,2019,2018,2017,2016]##### adding new columns to the data frame using list method
df3

   compay Ticker  price  Year
0     TCS    TCS    100  2020
1   WIPRO    WIP    200  2019
2  GOOGLE   GOOG    250  2018
3   YAHOO    YAH    310  2017
4   CISCO   CISC    280  2016

In [23]:
df3['Series']=np.array([200,3000,3000,4000,5000])#### adding new column using array method...
df3

   compay Ticker  price  Year  Series
0     TCS    TCS    100  2020     200
1   WIPRO    WIP    200  2019    3000
2  GOOGLE   GOOG    250  2018    3000
3   YAHOO    YAH    310  2017    4000
4   CISCO   CISC    280  2016    5000

In [9]:
df3['discountedprice']=df3['price']*0.9#### 10 percentage of discount price############
df3

   compay Ticker  price  discountedprice
0     TCS    TCS    100             90.0
1   WIPRO    WIP    200            180.0
2  GOOGLE   GOOG    250            225.0
3   YAHOO    YAH    310            279.0
4   CISCO   CISC    280            252.0

In [16]:
df3['Year']=[2001,2002,2003,2004,2005]
df3

   compay Ticker  price  discountedprice  Year
0     TCS    TCS    100             90.0  2001
1   WIPRO    WIP    200            180.0  2002
2  GOOGLE   GOOG    250            225.0  2003
3   YAHOO    YAH    310            279.0  2004
4   CISCO   CISC    280            252.0  2005

In [19]:
del df3['Year'] ## deleting the colummn in the data set 
df3

   compay Ticker  price  discountedprice
0     TCS    TCS    100             90.0
1   WIPRO    WIP    200            180.0
2  GOOGLE   GOOG    250            225.0
3   YAHOO    YAH    310            279.0
4   CISCO   CISC    280            252.0

In [22]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [23]:
df3.columns

Index(['compay', 'Ticker', 'price', 'discountedprice'], dtype='object')

In [24]:
df3.values

array([['TCS', 'TCS', 100, 90.0],
       ['WIPRO', 'WIP', 200, 180.0],
       ['GOOGLE', 'GOOG', 250, 225.0],
       ['YAHOO', 'YAH', 310, 279.0],
       ['CISCO', 'CISC', 280, 252.0]], dtype=object)

In [27]:
df3['price'].values

array([100, 200, 250, 310, 280], dtype=int64)

In [33]:
df3.ix[0]

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

compay             TCS
Ticker             TCS
price              100
discountedprice     90
Name: 0, dtype: object

In [33]:
df4=DataFrame(np.arange(1,26).reshape(5,5),index=[1,2,3,4,5],columns=list('ABCDE'))
df4

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [32]:
df4.ix[0]

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    1
B    2
C    3
D    4
E    5
Name: t, dtype: int32

In [11]:
df4.iloc[0]

A    1
B    2
C    3
D    4
E    5
Name: 1, dtype: int32

In [12]:
df4.iloc[0,0]

1

In [37]:
df4.iloc[:,0]### posotional feteching

t     1
u     6
v    11
x    16
y    21
Name: A, dtype: int32

In [13]:
df4.iloc[3:,0:]

    A   B   C   D   E
4  16  17  18  19  20
5  21  22  23  24  25

In [14]:
df4

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [15]:
df4.iloc[2:4,1:4]

    B   C   D
3  12  13  14
4  17  18  19

In [ ]:
####loc will be lables...

In [51]:
df4.loc[:,'B']

t     2
u     7
v    12
x    17
y    22
Name: B, dtype: int32

In [59]:
df4.loc[:,['B','D']]

    B   D
t   2   4
u   7   9
v  12  14
x  17  19
y  22  24

In [60]:
df4.loc[:,['B','C','D']]

    B   C   D
t   2   3   4
u   7   8   9
v  12  13  14
x  17  18  19
y  22  23  24

In [17]:
df4

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [19]:
df4.loc[1:3,['A','B']]

    A   B
1   1   2
2   6   7
3  11  12

In [25]:
df4.loc[1:6,['A','B','D']]

    A   B   D
1   1   2   4
2   6   7   9
3  11  12  14
4  16  17  19
5  21  22  24

In [26]:
df4.iloc[1:4,2:3]

    C
2   8
3  13
4  18

In [29]:
df4.drop(1)

    A   B   C   D   E
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [30]:
del df4['A']

In [31]:
df4

    B   C   D   E
1   2   3   4   5
2   7   8   9  10
3  12  13  14  15
4  17  18  19  20
5  22  23  24  25

In [34]:
df4

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [35]:
df4.drop(2)

    A   B   C   D   E
1   1   2   3   4   5
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [36]:
df4

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [39]:
df4.drop('A',axis=1)
df4

    A   B   C   D   E
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25

In [42]:
df4.drop('A',axis=1,inplace=True)####### using inplace real chagnges in the data set.......

KeyError: "['A'] not found in axis"